"""
рост = int(input("Введите ваш рост: "))
if рост <= 50:
    print("\nБЫСТРО УБИРАЙСЯ ОТСЮДА , МИЛЮЗГА")
else:
    print("ДОБРО ПОЖАЛОВАТЬ!")
"""
"""
число = int(input("Введите число и я скажу вам четное оно или нет: "))
if число % 2 == 0:
    print(f"\nЧисло - {число} - чётное")
else:
    print(f"\nчисло - {число} - нечетное")
"""

#1
машина = input("Какую машину вы бы хотели приобрести или взять на прокат?: ")
print(f"Вот машина которую вы выбрали - {машина} опробуйте на полигоне и пользуйтесь на здоровье!")

#2
столы = int(input("На сколько человек вы бы хотели взять столик?: "))
if столы <= 7:
    print("Проходите и думайте над заказом!")
else:
    print("Вам придется немного подождать!")

#3
число = int(input("Введите ваше число и я скажу вам кратно ли оно 10: "))
if число % 10 == 0:
    print(f"\nВаше число - {число} - кратно 10")
else:
    print(f"\nВАше число {число} ваще не кратно 10")



