"""
                        часть 1
1.input для ввода(буквенного) значения пользователем, а инт что бы можно было ввести числовое значение
2. принт выводит конкретно заданное значение, а ретурн возвращает какое то дейстиве или вычисление со значением.
3. for - когда уже есть заданное число повторений цикла
    while - цикл повторяется пока не будет выполнено условие
4. оператор % это деление с остатком 7 % 3
5. список это как коробка со значениями, вызывается [...] такими скобками, что бы добавить объект нужено ввести:
##название списка.append("что хочешь добавить")##
6. не выведется ничего.

                                часть 2

1.
x = int(input("Введите число")) # не хватало оператора int
if x > 10:
    print("Больше 10")

2.
ошибки нет, код работает

3. def square(n):
    print(n * n + 2)
result = square(4) # это скорее не правильно но результат вывел нужный
""
                                    #часть 3
""
x = int(input("введите число: "))
if x in range(2, x + 1):
    print(x)
else:
    print("none")
"""
numbers = [3, 8, 2, 7, 5, 10]
max_val = numbers
for i in numbers:
    i > max_val:
        max_val = i
print(max_val)

    
    
