"""
любимое_число = {
    "Савелий": "13",
    "Никита": "7",
    "Алена": "3",
    "Серафим": "777",
    "Артемий": "39",
    "Иван": "7",
    }

число = любимое_число["Савелий"]
число2 = любимое_число["Никита"]
число3 = любимое_число["Алена"]
число4 = любимое_число["Серафим"]
число5 = любимое_число["Артемий"]
число6 = любимое_число["Иван"]
print(f"Любимое число Савелия - {число}")
print(f"Любимое число Никиты - {число2}")
print(f"Любимое число Алены - {число3}")
print(f"Любимое число Серафима- {число4}")
print(f"Любимое число Артемия - {число5}")
print(f"Любимое число Ивана- {число6}")
"""


#страны = ["Россия", "Италия", "Португалия", "Япония", "Китай", "Белоруссия", "Латвия", "Литва", "Чехия", "Польша", "Словения", "Греция", "Люксембург", "Бельгия", "Казахстан", "Таджикистан", "Армения", "Молдова", "Туркменистан", "Индонезия"]
#print(страны)
#poped_страны = страны.pop()
#print(страны)
#p = "Польша"

#страны.remove(p)
#print(f"\nЭта ваша {p} слишком агрессивная для нас, поэтому мы ее удалили")

#страны.insert(7, "Бельгия")
#print(страны)

#страны.sort()
#print(страны)

#страны.sort(reverse = True)
#print(страны)

#страны.reverse()
#print(страны)
#страны.reverse()
#print(страны)

#print(len(страны))
































